In [1]:
import numpy as np
import pandas as pd

In [3]:
data = pd.DataFrame({'team':['A','A','A','A',"B",'B','B','B'],
                    'points':[10,10,12,12,15,17,20,20],
                    'assists':[5,5,7,9,12,9,6,6]})

In [5]:
data

  team  points  assists
0    A      10        5
1    A      10        5
2    A      12        7
3    A      12        9
4    B      15       12
5    B      17        9
6    B      20        6
7    B      20        6

In [7]:
data[data.duplicated()]

  team  points  assists
1    A      10        5
7    B      20        6

In [8]:
data[data.duplicated('team')]

  team  points  assists
1    A      10        5
2    A      12        7
3    A      12        9
5    B      17        9
6    B      20        6
7    B      20        6

In [9]:
data[data.duplicated(['team','points'])]

  team  points  assists
1    A      10        5
3    A      12        9
7    B      20        6

In [10]:
data.duplicated()

0    False
1     True
2    False
3    False
4    False
5    False
6    False
7     True
dtype: bool

In [17]:
data.drop_duplicates(inplace=True)

In [18]:
data

  team  points  assists
0    A      10        5
2    A      12        7
3    A      12        9
4    B      15       12
5    B      17        9
6    B      20        6